evidence/week3/latency.log
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/articles
Document Length:        33 bytes

Concurrency Level:      10
Time taken for tests:   0.501 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      17700 bytes
HTML transferred:       3300 bytes
Requests per second:    199.79 [#/sec] (mean)
Time per request:       50.052 [ms] (mean)
Time per request:       5.005 [ms] (mean, across all concurrent requests)
Transfer rate:          34.53 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:     9   48   7.8     50      64
Waiting:        8   47   7.8     47      63
Total:          9   48   7.8     50      65

Percentage of the requests served within a certain time (ms)
  50%     50
  66%     52
  75%     53
  80%     54
  90%     57
  95%     59
  98%     62
  99%     65
 100%     65 (longest request)